GHB2/src/Documents/гхб_ЗакреплениеПомещенийЗаСотрудниками/гхб_ЗакреплениеПомещенийЗаСотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеПомещенийЗаСотрудниками</name>
  <registerRecords>InformationRegister.гхб_ЗакреплениеСотрудниковЗаПомещениями</registerRecords>
  <registerRecords>InformationRegister.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений</registerRecords>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_ГруппыПомещений</types>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникиКраткийСостав</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗакрепления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СуществующийДоступ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботы</name>
      <type>
        <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
      </type>
    </attributes>
    <attributes>
      <name>Плавающее</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимРаботыСтарый</name>
      <type>
        <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлавающееСтарое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_ГруппыПомещений</types>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений/гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ЗакреплениеСотрудниковЗаГруппойПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
    </type>
  </attributes>
  <attributes>
    <name>Плавающее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаПомещений</name>
    <type>
      <types>CatalogRef.гхб_ГруппыПомещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ЗакреплениеСотрудниковЗаПомещениями/гхб_ЗакреплениеСотрудниковЗаПомещениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ЗакреплениеСотрудниковЗаПомещениями</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.гхб_РежимРаботыВПомещении</types>
    </type>
  </attributes>
  <attributes>
    <name>Плавающее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Documents/гхб_ЗакреплениеПомещенийЗаСотрудниками/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
		Помещение = Справочники.гхб_Помещения.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	СотрудникиКраткийСостав = "";
	
	Для Каждого Стр Из Сотрудники Цикл
		СотрудникиКраткийСостав = СотрудникиКраткийСостав + ?(ЗначениеЗаполнено(СотрудникиКраткийСостав), "; ", "") +
			ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Стр.Сотрудник)) + ?(Стр.Закрыть, " (з)", "");
	КонецЦикла;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
	   И РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
	   
	   	Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента) Тогда
		
		ДвиженияПоЗакреплениюСотрудников();
			
		РегистрыСведений.гхб_СобытияОбъектовБД.ЗаписатьДанныеСобытияОбъекта(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.ПервоеПроведениеДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗакрепления = 0 Тогда // за помещением
		ПроверяемыеРеквизиты.Добавить("Помещение");
	ИначеЕсли ТипЗакрепления = 1 Тогда // за сотрудником
		ПроверяемыеРеквизиты.Добавить("Сотрудник");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоЗакреплениюСотрудников()
	
	Для Каждого Стр Из Сотрудники Цикл
		
		Если (Стр.СуществующийДоступ И (Стр.Закрыть ИЛИ НЕ (Стр.Плавающее = Стр.ПлавающееСтарое) ИЛИ НЕ (Стр.РежимРаботы = Стр.РежимРаботыСтарый))) 
		 ИЛИ (НЕ Стр.СуществующийДоступ И НЕ Стр.Закрыть) Тогда 
		 
		 	Если ТипЗнч(Стр.Помещение) = Тип("СправочникСсылка.гхб_ГруппыПомещений") Тогда
		 
				_Строка = Движения.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.Добавить();
				_Строка.ГруппаПомещений = Стр.Помещение;
				
			Иначе 
				
				_Строка = Движения.гхб_ЗакреплениеСотрудниковЗаПомещениями.Добавить();
				_Строка.Помещение = Стр.Помещение;
				
			КонецЕсли;
			
			_Строка.Период = Дата;
			_Строка.Регистратор = Ссылка;
			_Строка.Сотрудник = Стр.Сотрудник;
			_Строка.РежимРаботы = Стр.РежимРаботы;
			_Строка.Плавающее = Стр.Плавающее;
			_Строка.Закрыть = Стр.Закрыть;
		
		КонецЕсли;
		
	КонецЦикла;
		
	Если НЕ (Движения.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.Количество() = 0) Тогда
		Движения.гхб_ЗакреплениеСотрудниковЗаГруппойПомещений.Записать();
	КонецЕсли;
	
	Если НЕ (Движения.гхб_ЗакреплениеСотрудниковЗаПомещениями.Количество() = 0) Тогда
		Движения.гхб_ЗакреплениеСотрудниковЗаПомещениями.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
